In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [22]:
ser1 = Series(np.arange(3), index=['A','B','C'])
ser1 = ser1*2
ser1

A    0
B    2
C    4
dtype: int64

In [23]:
# There are two ways to get the desired input from a series
ser1['B']

2

In [24]:
# or 
ser1[1]

2

In [25]:
ser1[0:]

A    0
B    2
C    4
dtype: int64

In [26]:
ser1[['A','B']]

A    0
B    2
dtype: int64

In [28]:
ser1[ser1>3]

C    4
dtype: int64

In [30]:
# Setting up a boolean impression to change the values of the series
ser1[ser1>3] = 10
ser1

A     0
B     2
C    10
dtype: int64

In [33]:
dframe = DataFrame(np.arange(25).reshape((5,5)),
                  index=['NU','BY','LA','MI','WH'],
                  columns=['a','b','c','d','e'])
dframe

     a   b   c   d   e
NU   0   1   2   3   4
BY   5   6   7   8   9
LA  10  11  12  13  14
MI  15  16  17  18  19
WH  20  21  22  23  24

In [34]:
# Extracting one columns
dframe['b']

NU     1
BY     6
LA    11
MI    16
WH    21
Name: b, dtype: int64

In [35]:
# Extracting mult. columns
dframe[['b', 'e']]

     b   e
NU   1   4
BY   6   9
LA  11  14
MI  16  19
WH  21  24

In [40]:
# It looks at the columns of each row
# And it returns the entire row, not just the specific column 
dframe[dframe['c']>8]

     a   b   c   d   e
LA  10  11  12  13  14
MI  15  16  17  18  19
WH  20  21  22  23  24

In [41]:
# Boolean comparsion
dframe > 10

        a      b      c      d      e
NU  False  False  False  False  False
BY  False  False  False  False  False
LA  False   True   True   True   True
MI   True   True   True   True   True
WH   True   True   True   True   True

In [42]:
# To get the specific row, with its title
dframe.loc['LA']

a    10
b    11
c    12
d    13
e    14
Name: LA, dtype: int64

In [44]:
# Or to use the index 
dframe.iloc[2]

a    10
b    11
c    12
d    13
e    14
Name: LA, dtype: int64